1)
//что такое JSON?
JavaScriptObjectNotation
2)
//зачем использовать JSON?  
для хранения информации
3)
//преобразуйте строку ниже в обьект JSON и выведите в консоли
let str = '{name: "Alex", age: 24}';
str.JSON
4)
//преобразуйте обьект ниже в строку и выведите в консоли
let obj = { name: "Alex", age: 24 };
obj.stringify()
5)
//создайте в отдельности 2 переменные и присвойте одному обьект JSON другому обьект Javascript
let a = {}
let b = new JSON()
6)
//какие типы данных может содержать JSON обьект?
File, picture,
    7)
//какие типы данных не может содержать обьект?
File, picture,
    8)
//в каком виде мы получаем JSON с сервера?
JSON.json
9)
//в каком виде мы отправляем JSON на сервер?
JSON.json