/* 1)
//выведите в консоли ширину и высоту окна браузера с помощью window
console.log(window.width)
console.log(window.height)
2)
//создайте обработчик события для кнопки ниже, которая будет открывать новое окно в браузере при нажатии
<button id='open'>Open</button>
document.addEventListener(#open, a)
function a() {
    window.open()
}
3)
//создайте обработчик события для кнопки ниже, которая будет закрывать текущее окно в браузере при нажатии
<button id='close'>Open</button>
document.addEventListener(#close, a)
function a() {
    window.open()
}
4)
//создайте обработчик события для кнопки ниже, которая будет перемещать текущее окно в браузере при нажатии
<button id='move'>Open</button>
document.addEventListener(#move, a)
function a() {
    window.move()
}
5)
//создайте обработчик события для кнопки ниже, которая будет менять размер текущего окно в браузере при нажатии
<button id='remove'>Open</button>
document.addEventListener(#remove, a)
function a() {
    window.remove()
}
6)
//выведите в консоли ширину экрана пользователя в пикселях
console.log(window.Innerwidth())
7)
//выведите в консоли высоту экрана пользователя в пикселях
console.log(window.Innerheight())
8)
//выведите в консоли ширину экрана пользователя без панели задач и интерфейса вкладок в пикселях
6
9)
//выведите в консоли высоту экрана пользователя без панели задач и интерфейса вкладок в пикселях
7
10)
//выведите в консоли сколько битов использует браузер пользователя
не знаю
11)
//выведите в консоли глубину экрана пользователя в пикселях
console.log(screen.ColorDeph)
12)
//создайте обработчик события для кнопки ниже, которая будет перекидывать на предыдущую страницу в браузере при нажатии
<button id='back'>Open</button>

document.addEvenetLisener('#back', ads)
function a() {
    return window.back()

}
13)
//создайте обработчик события для кнопки ниже, которая будет перекидывать на следующую страницу в браузере при нажатии
<button id='next'>Open</button>
document.addEvenetLisener('#next', ads)
function a() {
    return window.next()

}
14)
//с помощью какого свойства можно проверить включены ли у пользователя куки
cookieEnabled
15)
//с помощью какого свойства можно проверить как называется имя приложения в браузере пользователя
navigator.appName
16)
//с помощью какого свойства можно проверить как называется имя браузера пользователя
navigator.appCodeName
17)
//с помощью какого свойства можно проверить какая версия у браузера пользователя
appVersion
18)
//с помощью какого свойства можно отправить заголовок браузера на сервер
userAgent
19)
//с помощью какого свойства можно узнать операционную систему пользователя
Platform
20)
//с помощью какого свойства можно узнать язык браузера пользователя
Language
21)
//с помощью какого свойства можно узнать находится в данный момент пользователь в сети или нет
online
22)
//с помощью какого свойства можно проверить включен ли java у пользователя
javaEnabled() 
/*