1)
//выведите в консоли каждый элемент из массива [45, 12, 3, 2, 1, 35] с помощью forEach()
array.forEach(element => {
    console.log(element);
});
2)
//создайте новый массив с помощью map() из массива [45, 46, 47] в котором все значения будут удвоены и выведите в консоли
array.map(element => {
    return element * 2
});
3)
//создайте новый массив только из чисел больше 5ти из массива [45, 12, 3, 2, 1, 35] с помощью filter()
let F = [45, 12, 3, 2, 1, 35]
F.filter(fonk => element > 5)
4)
//сложите все числа из массива [45, 12, 3, 2, 1, 35] с помощью reduce() и выведите результат в консоли
F.reduce()
5)
//сложите все числа из массива [45, 12, 3, 2, 1, 35] с помощью reduce() и начального значения 50, выведите результат в консоли

6)
//создайте массив только из чисел больше 5ти используя every() из массива [45, 12, 3, 2, 1, 35]

7)
//создайте массив только из чисел больше 5ти используя some() из массива [45, 12, 3, 2, 1, 35]

8)
//используйте метод indexOf чтобы найти индекс 'apple' в массиве ниже

9)
//используйте метод lastIndexOf чтобы найти индекс последнего 'apple' в массиве ниже

10)
//проверьте находится ли 'apple' в массиве ниже

11)
//выведите в консоли первое число которое больше 5ти из массива [1, 3, 4, 9, 0, 20]

12)
//выведите в консоли индекс первого числа который больше 5ти из массива [1, 3, 4, 9, 0, 20]

13)
//превратите строку 'Hello' в массив с помощью from()

14)
//выведите в консоли все ключи из массива

